var products = {
  "result": [
    {"name": "你好", "title": "世界末日你还好吗"},
    {"name": "你好", "title": "世界末日你还好吗"},
    {"name": "你好", "title": "世界末日你还好吗"},
    {"name": "你好", "title": "世界末日你还好吗"},
    {"name": "你好", "title": "世界末日你还好吗"},
    {"name": "你好", "title": "世界末日你还好吗"},
    {"name": "你好", "title": "世界末日你还好吗"},
    {"name": "你好", "title": "世界末日你还好吗"},
    {"name": "你好", "title": "世界末日你还好吗"},
    {"name": "你好", "title": "世界末日你还好吗"},
    {"name": "你好", "title": "世界末日你还好吗"},
    {"name": "你好", "title": "世界末日你还好吗"},
    {"name": "你好", "title": "世界末日你还好吗"},
    {"name": "你好", "title": "世界末日你还好吗"},
    {"name": "你好", "title": "世界末日你还好吗"},
    {"name": "你好", "title": "世界末日你还好吗"},
    {"name": "你好", "title": "世界末日你还好吗"},
    {"name": "你好", "title": "世界末日你还好吗"},
    {"name": "你好", "title": "世界末日你还好吗"},
    {"name": "你好", "title": "世界末日你还好吗"},
    {"name": "你好", "title": "世界末日你还好吗"},
  ]
};

var news = {
  "data": [
    {
      "title": "新闻号外:XXX女子深夜买醉 竟然是因为情场失意",
      "type": 1,
      "id": "00008980122ertazt",
      "desc": "奥斯卡静安寺克拉斯看看地覅偶尼克斯;阿卡卡;喀什市拉开毒贩夫妇付付"
    },
    {
      "title": "新闻号外:XXX女子深夜买醉 竟然是因为情场失意",
      "type": 1,
      "id": "00008980122ertazt",
      "desc": "奥斯卡静安寺克拉斯看看地覅偶尼克斯;阿卡卡;喀什市拉开毒贩夫妇付付"
    },
    {
      "title": "新闻号外:XXX女子深夜买醉 竟然是因为情场失意",
      "type": 1,
      "id": "00008980122ertazt",
      "desc": "奥斯卡静安寺克拉斯看看地覅偶尼克斯;阿卡卡;喀什市拉开毒贩夫妇付付"
    },
    {
      "title": "新闻号外:XXX女子深夜买醉 竟然是因为情场失意",
      "type": 1,
      "id": "00008980122ertazt",
      "desc": "奥斯卡静安寺克拉斯看看地覅偶尼克斯;阿卡卡;喀什市拉开毒贩夫妇付付"
    },
    {
      "title": "新闻号外:XXX女子深夜买醉 竟然是因为情场失意",
      "type": 1,
      "id": "00008980122ertazt",
      "desc": "奥斯卡静安寺克拉斯看看地覅偶尼克斯;阿卡卡;喀什市拉开毒贩夫妇付付"
    },
    {
      "title": "新闻号外:XXX女子深夜买醉 竟然是因为情场失意",
      "type": 1,
      "id": "00008980122ertazt",
      "desc": "奥斯卡静安寺克拉斯看看地覅偶尼克斯;阿卡卡;喀什市拉开毒贩夫妇付付"
    },
    {
      "title": "新闻号外:XXX女子深夜买醉 竟然是因为情场失意",
      "type": 1,
      "id": "00008980122ertazt",
      "desc": "奥斯卡静安寺克拉斯看看地覅偶尼克斯;阿卡卡;喀什市拉开毒贩夫妇付付"
    },
    {
      "title": "新闻号外:XXX女子深夜买醉 竟然是因为情场失意",
      "type": 1,
      "id": "00008980122ertazt",
      "desc": "奥斯卡静安寺克拉斯看看地覅偶尼克斯;阿卡卡;喀什市拉开毒贩夫妇付付"
    },
    {
      "title": "新闻号外:XXX女子深夜买醉 竟然是因为情场失意",
      "type": 1,
      "id": "00008980122ertazt",
      "desc": "奥斯卡静安寺克拉斯看看地覅偶尼克斯;阿卡卡;喀什市拉开毒贩夫妇付付"
    },
    {
      "title": "新闻号外:XXX女子深夜买醉 竟然是因为情场失意",
      "type": 1,
      "id": "00008980122ertazt",
      "desc": "奥斯卡静安寺克拉斯看看地覅偶尼克斯;阿卡卡;喀什市拉开毒贩夫妇付付"
    },
    {
      "title": "新闻号外:XXX女子深夜买醉 竟然是因为情场失意",
      "type": 1,
      "id": "00008980122ertazt",
      "desc": "奥斯卡静安寺克拉斯看看地覅偶尼克斯;阿卡卡;喀什市拉开毒贩夫妇付付"
    },
    {
      "title": "新闻号外:XXX女子深夜买醉 竟然是因为情场失意",
      "type": 1,
      "id": "00008980122ertazt",
      "desc": "奥斯卡静安寺克拉斯看看地覅偶尼克斯;阿卡卡;喀什市拉开毒贩夫妇付付"
    },
    {
      "title": "新闻号外:XXX女子深夜买醉 竟然是因为情场失意",
      "type": 1,
      "id": "00008980122ertazt",
      "desc": "奥斯卡静安寺克拉斯看看地覅偶尼克斯;阿卡卡;喀什市拉开毒贩夫妇付付"
    },
    {
      "title": "新闻号外:XXX女子深夜买醉 竟然是因为情场失意",
      "type": 1,
      "id": "00008980122ertazt",
      "desc": "奥斯卡静安寺克拉斯看看地覅偶尼克斯;阿卡卡;喀什市拉开毒贩夫妇付付"
    },
    {
      "title": "新闻号外:XXX女子深夜买醉 竟然是因为情场失意",
      "type": 1,
      "id": "00008980122ertazt",
      "desc": "奥斯卡静安寺克拉斯看看地覅偶尼克斯;阿卡卡;喀什市拉开毒贩夫妇付付"
    },
  ]
};
